<?php

return array(
    // 要返回的代号=>代号信息
    'SHOW_PAGE_TRACE' =>FALSE, // 显示页面Trace信息
    'LOGIN_TYPE' => TRUE,// 是否为单设备状态
    // 单设备状态,即另一个设备上登录会顶替掉当前设备的登录状态
    // false为多设备状态,使用下方的LOGIN_TYPE_NUMBER限制每种设备的数量
    'LOGIN_TYPE_NUMBER' => 1,// 每种设备允许几处登录
    'LOGIN_TYPE_AUTO_CLEAR' => TRUE,// 是否自动清除登录设备
    // 自动清除登录设备是针对多设备状态规定的。
    //      即如果设置了多设备登录,到达规定数量后,下次登录会自动清除最早的一台登录设备
    // 如果是单设备登录,建议设置该值为TRUE。
    //      备注:如果该值时false且LOGIN_TYPE值为TRUE则表示退出也不清除状态
    //              [使用该状态表示该用户禁止退出]
    //          如果该值时false且LOGIN_TYPE值为FALSE则表示退出会清除当前状态
    //          如果该值时TRUE且LOGIN_TYPE值为TRUE则表示退出会自动清除状态
    //          如果该值时TRUE且LOGIN_TYPE值为false则表示退出会自动清除状态
    'ERROR_CODE' => array(
        // 常用错误代码R系列
        'R0000' => '成功',// 该代码为唯一的成功代码,只有检测到该值才为数据查询成功
        'R0001' => '失败',
        'R0002' => '项目未授权',
        'R0003' => '该项目未公开或未找到',
        'R0004' => '该项目未公开或未找到',
        'R0005' => '系统错误',
        'R0006' => '域名格式传输有误',
        // 系统错误S系列
        'S0001' => '访问路径错误',
        'S0002' => '系统错误',
        // 访问错误F系列
        'F0001' => '参数错误',
        // 用户错误U系列
        'U0001' => '账户名或密码输入错误',
        'U0002' => '该用户禁止登录',
        'U0003' => '设备限制,禁止登录',
        'U0004' => '设备限制,禁止退出',
    ),
);
